<script setup>
import { getImageUrl } from '@/utils/image';

const headerImage = getImageUrl(
  "@/assets/images/Knowledge/ColorfulVegetablesView.jpg"
);
</script>

<template>
  <div class="p-6 bg-white rounded-lg shadow-md">
    <div>
      <img :src="headerImage" alt="Colorful Vegetables" class="w-full h-48 object-cover rounded-lg" />
    </div>
    <h2 class="text-2xl font-bold text-center text-green-600 mb-4">
      มหัศจรรย์ของสีสันในผักผลไม้
    </h2>
    <p class="text-gray-700 mb-4">
      ผัก ผลไม้จัดเป็นหนึ่งในอาหารหลัก 5 หมู่ เเนะนำให้กินผักผลไม้ที่หลากหลาย
      เเละมีสีสันต่างๆหมุนเวียนไป เพื่อให้ร่างกายได้รับสารต่างๆ
      ที่เป็นประโยชน์อย่างสมดุล
    </p>
    <ul class="list-disc list-inside text-left mb-4">
      <li class="mb-2">
        <span class="font-semibold text-green-500">ผักสีเขียว:</span> กวางตุ้ง
        บัวบก ชะพลู – ลดการเสื่อมจอประสาทตา ลดความเสี่ยงมะเร็งเต้านม
      </li>
      <li class="mb-2">
        <span class="font-semibold text-yellow-500">ผักสีเหลือง-ส้ม:</span>
        เเครอท มะเขือเทศ ฟักทอง ส้ม มะละกอ – รักษาหัวใจเเละหลอดเลือด
        ภูมิคุ้มกันของร่างกาย เเละสายตา
      </li>
      <li class="mb-2">
        <span class="font-semibold text-purple-500">ผักสีน้ำเงิน-ม่วง:</span>
        กะหล่ำม่วง หัวบีท องุ่นม่วงเเดง เชอร์รี่ – ชะลอความเสื่อมของเซลล์ความจำ
        ลดความเสี่ยงของการเกิดโรคหัวใจ เเละหลอดเลือด
      </li>
      <li class="mb-2">
        <span class="font-semibold text-gray-500">ผักสีขาว-น้ำตาล:</span>
        กระเทียม – สร้างเซลล์ให้เเข็งเเรง ลดน้ำตาลเเละไขมันในเลือด ลดความดัน
        ต้านการอักเสบ ยับยั้งการเกิดเนื้องอก
      </li>
      <li class="mb-2">
        <span class="font-semibold text-red-500">ผักสีเเดง:</span> มะเขือเทศ
        เเตงโม สตรอว์เบอร์รี่ –
        ช่วยป้องกันเเละยับยั้งการเติบดตของเซลล์มะเร็งเต้านม มะเร็งต่อมลูกหมาก
        มะเร็งลำไส้ใหญ่ เเละมะเร็งเยื่อบุมดลูก ช่วยให้ภาวะผิดปกติ เช่น โรคหัวใจ
        เบาหวาน เเละกระดูกพรุนดีขึ้น
      </li>
    </ul>
    <p class="text-gray-700 mb-4">
      ผักและผลไม้ เป็นอาหารที่กินดี มีประโยชน์ อุดมไปด้วยแร่ธาตุและวิตามินต่างๆ
      ที่จำเป็นต่อร่างกาย ผลการวิจัยและการค้นคว้ามากมายพบว่าผักผลไม้แต่ละสี
      ให้คุณประโยชน์ที่แตกต่างกัน หากต้องการได้รับประโยชน์อย่างเต็มที่
      จึงควรทานผักผลไม้ให้หลากสีด้วยครับ เรามาดูกันดีกว่าครับว่า
      ประโยชน์ของผลไม้ และผักแต่ละกลุ่มสีนั้น ต่างกันอย่างไรบ้าง
    </p>
    <ul class="list-disc list-inside text-left">
      <li class="mb-2">
        <span class="font-semibold text-green-500">ผักผลไม้สีเขียว:</span>
        สีเขียวในผักและผลไม้ให้สารคลอโรฟิลล์ (Cholorophyll) ช่วยต้านอนุมูลอิสระ
        ลดความเสี่ยงในการเกิดมะเร็ง ทำให้ผิวพรรณสดใส นอกจากนี้ยังมีกากใยสูง
        มีส่วนช่วยลดอาการท้องผูก และทำให้ขับถ่ายดี ตัวอย่างเช่น ผักบุ้ง ผักโขม
        ผักปวยเล้ง ผักกาดหอม ผักคะน้า แตงกวา
        รวมถึงผลไม้สีเขียวอย่างแอปเปิ้ลเขียว และฝรั่งด้วย
      </li>
      <li class="mb-2">
        <span class="font-semibold text-yellow-500"
          >ผักผลไม้สีเหลืองหรือส้ม:</span
        >
        สีเหลืองหรือส้มในผักและผลไม้นั้น ให้สารเบต้าแคโรทีน (Betacarotene)
        และฟลาโวนอยด์ (Flavonoids) ช่วยรักษาสุขภาพของหัวใจ หลอดเลือด
        ระบบภูมิคุ้มกันของร่างกาย บำรุงสายตา เช่น แครอท ฟักทอง มันเทศ มะละกอ
        เสาวรส และข้าวโพด เป็นต้น
      </li>
      <li class="mb-2">
        <span class="font-semibold text-purple-500">ผักผลไม้สีม่วง:</span>
        สีม่วงในผักและผลไม้ให้สารแอนโทไซยานิน (Anthocyanin)
        ช่วยชะลอการเสื่อมของเซลล์ลดอัตราเสี่ยงของการเกิดโรคหัวใจและเส้นเลือดอุดตันในสมอง
        ยับยั้งเชื้ออีโคไลในทางเดินอาหาร ซึ่งทำให้เกิดอาการอาหารเป็นพิษได้ เช่น
        กะหล่ำสีม่วง มะเขือม่วง บลูเบอรี่ และดอกอัญชัญ เป็นต้น
      </li>
      <li class="mb-2">
        <span class="font-semibold text-red-500">ผักผลไม้สีแดง:</span>
        ในผักผลไม้สีแดงมีสารไลโคปีน (Lycopene)
        ซึ่งมีฤทธิ์ต่อต้านอนุมูลอิสระที่สูงมาก มากกว่าวิตามินอี 100 เท่า
        และมากกว่ากลูตาไธโอนถึง 125 เท่า ช่วยป้องกันการเกิดมะเร็งต่อมลูกหมาก
        มะเร็งกระเพาะอาหาร และมะเร็งปอด
        และยังช่วยยับยั้งการเติบโตของเซลล์มะเร็งเต้านม มะเร็งต่อมลูกหมาก
        มะเร็งลำไส้ใหญ่ และมะเร็งเยื่อบุมดลูก เช่น มะเขือเทศ หอมแดง แตงโม
        เป็นต้น
      </li>
      <li class="mb-2">
        <span class="font-semibold text-gray-500"
          >ผักผลไม้สีขาวหรือน้ำตาล:</span
        >
        ให้สารอัลไลซิน(Allicin) สร้างเซลล์ให้แข็งแรง
        ยับยั้งการเกิดเนื้องอกช่วยลดความเสี่ยงการเป็นมะเร็งเต้านม
        มะเร็งลำไส้ใหญ่ มะเร็งต่อมลูกหมาก ต้านการอักเสบ ลดระดับน้ำตาลในเลือด
        ลดปริมาณไขมันในเลือด ลดความดันโลหิต ป้องกันเส้นเลือดอุดตัน
        รักษาระบบภูมิคุ้มกัน เช่น กระเทียม หัวไชเท้า ถั่วเหลือง เป็นต้น
      </li>
    </ul>
  </div>
</template>
