<script setup>
import { getImageUrl } from "@/utils/image";

const headerImage = getImageUrl(
  "@/assets/images/Knowledge/ExerciseMistakesView.png"
);
</script>

<template>
  <div class="p-6">
    <div class="flex justify-center">
      <img
        class="w-2/4 h-auto mb-6 rounded"
        :src="headerImage"
        alt="5 วิธีออกกําลังกายเพื่อลดนํ้าหนักผิด ๆ ที่คนมักไม่รู้ตัว"
      />
    </div>
    <h2 class="text-2xl font-bold mb-4">
      5 วิธีออกกําลังกายเพื่อลดนํ้าหนักผิด ๆ ที่คนมักไม่รู้ตัว
    </h2>

    <ol class="list-none list-inside space-y-4">
      <li>
        <strong class="block mb-2"
          >ไม่ทานอาหารที่ให้พลังงานก่อนออกกำลังกาย</strong
        >
        <p class="text-gray-700">
          บางคนบ้าออกกำลังกายมาก เพื่อให้รูปร่างเล็กลง น้ำหนักลดลง
          จึงพยายามควบคุมปริมาณอาหารที่ทานเข้าไป และไปออกกำลังกายหนักๆ
          ด้วยเข้าใจว่าจะ “เบิร์น” เอาพลังงานที่ทานเกินเข้าไปออกให้หมด
          แต่ทราบหรือไม่ว่า หากไม่ทานอาหารที่ให้พลังงานกับร่างกายเลย
          แล้วไปออกกำลังกายหนักๆ นอกจากจะมีสิทธิ์เป็นลมเป็นแล้งไปได้แล้ว
          ยังอาจเสี่ยงเป็นโรคขาดสารอาหารในระยะยาวอีกด้วย
          และบอกได้เลยว่าร่างกายรวนแน่ๆ เพราะฉะนั้นทานอาหารให้หลากหลาย
          ทานอาหารให้ครบทุกหมู่ เพียงแต่จำกัดปริมาณให้ดี
          แล้วค่อยออกกำลังกายดีกว่าค่ะ
        </p>
      </li>
      <li>
        <strong class="block mb-2">ออกกำลังกายท่าเดียว</strong>
        <p class="text-gray-700">
          เคยเห็นคนที่ไปออกกำลังกายที่ฟิตเนส แล้วเอาแต่ยกเวทหรือเปล่าคะ
          หากเขาลุกไปเล่นเครื่องออกกำลังกายอื่นๆ ด้วยก็ดีไป
          แต่ถ้าเห็นเขาเล่นแต่แขนอย่างเดียว หรือกล้ามเนื้อท้องอย่างเดียว
          ต้องเตือนเขาแล้วล่ะ
          เพราะการออกกำลังกายเพื่อความแข็งแรงของร่างกายอย่างแท้จริง
          ต้องออกกำลังกายให้ได้ทุกส่วน ทั้งแขน ขา หน้าท้อง สะโพก หรือส่วนอื่นๆ
          ด้วย ถ้าหน้าท้องมีซิกแพค แต่แขนขาไม่เฟิร์มก็คงแปลกๆ
          ดังนั้นพยายามออกกำลังกายให้ครบทุกส่วนนะคะ
        </p>
      </li>
      <li>
        <strong class="block mb-2">คาร์ดิโอมากเกินไป</strong>
        <p class="text-gray-700">
          มีอีกบางจำพวกที่เอาแต่วิ่งๆ กระโดดๆ ว่ายน้ำ ปั่นจักรยาน
          กระตุ้นให้ร่างกายเหนื่อยหอบ หัวใจเต้นอยู่ตลอดเวลา
          หากเล่นคาร์ดิโอเพื่อเบิร์นหนักๆ
          ร่างกายจะเริ่มปรับตัวให้คุ้นชินกับการเบิร์นในแบบนั้น จากที่เคยใช้เวลา
          30 นาที เพื่อเบิร์น 200 กิโลแคลอรี่ หากร่างกายปรับตัวเมื่อไร
          เราอาจจะวิ่งได้นานขึ้น เหนื่อยน้อยลง แต่เผาผลาญพลังงานเท่าเดิม ดังนั้น
          เราควรออกกำลังกายแบบอื่นๆ สลับกันไปเรื่อยๆ
          อย่าให้ร่างกายคุ้นชินกับคาร์ดิโอมากเกินไป
        </p>
      </li>
      <li>
        <strong class="block mb-2">ไม่วอร์มอัพ-คูลดาวน์</strong>
        <p class="text-gray-700">
          หลายคนไม่เห็นความสำคัญของการวอร์มร่างกายก่อนออกกำลังกาย
          และลืมที่จะคูลดาวน์หลังออกกำลังกายด้วย
          แต่รู้หรือไม่ว่าทั้งสองอย่างนี้มีความสำคัญต่อร่างกายมากๆ
          เพราะการวอร์มอัพ และคูลดาวน์เป็นการช่วยลดการบาดเจ็บของกล้ามเนื้อได้ดี
          นอกจากนี้ยังเป็นการวอร์มกล้ามเนื้อหัวใจ ให้เต้นเป็นจังหวะ
          ไม่เร่งเร้าการสูบฉีดโลหิตมากเกินไป ลดอาการเหนื่อยหอบอย่างเฉียบพลัน
          หรือหน้ามืดจากการออกกำลังกายได้มากขึ้นอีกด้วย
        </p>
      </li>
      <li>
        <strong class="block mb-2">นับแคลอรี่เป็นบ้าเป็นหลัง</strong>
        <p class="text-gray-700">
          จะกินอะไรก็นั่งนับอย่างละเอียด หยิบเครื่องคิดเลขมานั่งกดๆ เกินไป 10
          กิโลแคลอรี่ก็จะไม่กิน แบบนี้เรียกว่าเคร่งครัดเกินไป
          ซึ่งอาจก่อให้เกิดปัญหาทางสุขภาพจิตได้ในภายหลัง
          ทางที่ดีควรทานอย่างระมัดระวัง ทานพออิ่ม เลือกประเภทของอาหารที่ทาน
          มีสติว่าวันนี้ทานอะไรไปบ้าง ควรหรือไม่ควรทานต่อ แล้วออกกำลังกายตามปกติ
          ทำเป็นประจำทุกวัน เท่านี้ก็ไม่ต้องนับแคลอรี่ให้วุ่นวาย
          นอกจากจำนวนแคลอรี่จะไม่ได้เท่ากันทุกจาน ทุกมื้ออย่างที่เข้าใจแล้ว
          หากกลางวันทานเยอะแล้ว แก้ปัญหาด้วยการไม่ทานอาหารเย็นเลย
          ก็อาจเสี่ยงเป็นโรคกระเพาะในอนาคตได้
        </p>
      </li>
    </ol>
    <p class="mt-4 text-gray-700">
      ทั้งนี้ทั้งนั้น หากอยากออกกำลังกายเพื่อลดน้ำหนักอย่างเห็นผล
      แต่ไม่แน่ใจในท่าออกกำลังกาย หรือการทานอาหาร
      เพื่อความปลอดภัยของร่างกายเราเอง คุณสามารถขอรับคำปรึกษาจากนักโภชนาการ
      และเทรนเนอร์ประจำฟิตเนสได้ค่ะ
    </p>
  </div>
</template>
